`modified`: change diagram visualization using mermaid
